app/controllers/tasks_controller.rb

    task = Task.new(task_params)
    if task.save
---
INSERT INTO "tasks" ("title", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["title", "Sed corrupti ea molestiae odio."], ["created_at", "2022-06-15 23:09:41.202590"], ["updated_at", "2022-06-15 23:09:41.202590"]]

  def update
    authorize_action(task)

    if task.update(task_params)
---
UPDATE "tasks" SET "title" = $1, "updated_at" = $2 WHERE "tasks"."id" = $3  [["title", "Quisquam voluptas sint fuga porro."], ["updated_at", "2022-06-15 23:19:14.296448"], ["id", 13]]

  def destroy
    authorize_action(task)

    if task.destroy
---
DELETE FROM "tasks" WHERE "tasks"."id" = $1  [["id", 15]]